01_test_cases/02_Haroun2010_Fig1/He_H2S/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.001 0 0)
    (0.001 1 0)
    (0 1 0)
    (0 0 0.001)
    (0.001 0 0.001)
    (0.001 1 0.001)
    (0 1 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 150 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    liquid
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }
    
    gas
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (2 6 5 1)
            (0 4 7 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
