01_test_cases/02_Haroun2010_Fig1/He_H2S/0/C.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    liquid
    {
        type            fixedValue;
        value           uniform 0.5;
    }

    gas
    {
        type            fixedValue;
        value           uniform 1.0;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
